src/views/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-30 mar 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jelou" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org99c68e9">1. [TODO] [#A] Guia de git <code>[0%]</code></a>
<ul>
<li><a href="#org92b1635">1.1. [TODO] Como manejarse con los tags y las versiones</a></li>
<li><a href="#org7af306d">1.2. [TODO] Cuando crear un branch (nuevas caracteristicas)</a></li>
<li><a href="#orgdf9ee21">1.3. [TODO] Cuando crear un tag (para armar releases)</a></li>
<li><a href="#org339a684">1.4. [TODO] Investigar las graficas que se forman</a></li>
<li><a href="#org66c5f05">1.5. Cuando crear issues</a></li>
<li><a href="#org0db9b14">1.6. Cuando crear pull request</a></li>
<li><a href="#orgb1c022b">1.7. Utilidad de crear plantillas en los pull request (como hacen las entregas de tp en pdep)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org99c68e9" class="outline-2">
<h2 id="org99c68e9"><span class="section-number-2">1</span> [TODO] [#A] Guia de git <code>[0%]</code></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org92b1635" class="outline-3">
<h3 id="org92b1635"><span class="section-number-3">1.1</span> [TODO] Como manejarse con los tags y las versiones</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Algunas preguntas que se me ocurren
</p>
<ul class="org-ul">
<li>Deberia hacer una lista de nuevas caracteristicas/funcionalidades por cada version?</li>
<li>Por correcciones de tantos bugs pasaria de v0.1.0 a v0.1.1 ?</li>
</ul>
<p>
Pagina: <a href="https://github.com/org-trello/org-trello/blob/master/TODO.org">Org-Trello</a>
</p>
</div>
</div>
<div id="outline-container-org7af306d" class="outline-3">
<h3 id="org7af306d"><span class="section-number-3">1.2</span> [TODO] Cuando crear un branch (nuevas caracteristicas)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
github branches para separar nuevas caracteristicas y para separar resolución de bugs
</p>
<ol class="org-ol">
<li><a href="https://docs.github.com/es/github/collaborating-with-issues-and-pull-requests/about-branches">https://docs.github.com/es/github/collaborating-with-issues-and-pull-requests/about-branches</a></li>
<li><a href="https://docs.github.com/es/desktop/contributing-and-collaborating-using-github-desktop/managing-branches">https://docs.github.com/es/desktop/contributing-and-collaborating-using-github-desktop/managing-branches</a></li>
<li><a href="https://www.genbeta.com/desarrollo/manejo-de-ramas-de-desarrollo-con-git">https://www.genbeta.com/desarrollo/manejo-de-ramas-de-desarrollo-con-git</a></li>
<li><a href="https://www.hostinger.es/tutoriales/que-es-github">https://www.hostinger.es/tutoriales/que-es-github</a></li>
<li><a href="https://www.hostinger.es/tutoriales/como-usar-git-branch">https://www.hostinger.es/tutoriales/como-usar-git-branch</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgdf9ee21" class="outline-3">
<h3 id="orgdf9ee21"><span class="section-number-3">1.3</span> [TODO] Cuando crear un tag (para armar releases)</h3>
</div>
<div id="outline-container-org339a684" class="outline-3">
<h3 id="org339a684"><span class="section-number-3">1.4</span> [TODO] Investigar las graficas que se forman</h3>
</div>
<div id="outline-container-org66c5f05" class="outline-3">
<h3 id="org66c5f05"><span class="section-number-3">1.5</span> Cuando crear issues</h3>
</div>
<div id="outline-container-org0db9b14" class="outline-3">
<h3 id="org0db9b14"><span class="section-number-3">1.6</span> Cuando crear pull request</h3>
</div>
<div id="outline-container-orgb1c022b" class="outline-3">
<h3 id="orgb1c022b"><span class="section-number-3">1.7</span> Utilidad de crear plantillas en los pull request (como hacen las entregas de tp en pdep)</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-03-30 mar 21:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
